src/main/resources/WS/xmlBodies/createBooking.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xft="http://www.exchangefortravel.org/xft/current" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-16009048" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:Username>svc-test-healthcheck</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">986+PRTy</wsse:Password>
                <wsu:Created>2014-07-08T10:26:01+02:00</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <Transaction TimeStamp="2017-01-28T19:44:55+01:00" Version="1.1" xsi:schemaLocation="http://www.exchangefortravel.org/xft/current http://www.exchangefortravel.org/xft/current/xft.xsd" xsi:type="TransactionRequestType" xmlns="http://www.exchangefortravel.org/xft/current" xmlns:xi="http://www.w3.org/2001/XInclude" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <Control>
                <Requester Channel="Internet" Code="PV" Application="ALP" Engine="PV" Tool="BookingEngine">
                    <Host Name="ERESAHD"/>
                    <Country Code="FR"/>
                    <Person>
                        <Codes>
                            <Code Role="Offer" Value="BASIC" Name="RatePlan" ID="ID1"/>
                        </Codes>
                    </Person>
                </Requester>
            </Control>
            <Action Purpose="Create" Code="Option"/>
            <Style Direction="Out"/>
            <Customer>
                <Name>
                    <FirstName ID="FNAME">Ludovic</FirstName>
                    <LastName ID="NAME">Poulain</LastName>
                </Name>
                <Address>
                    <Streets>
                        <Street Index="1">13 rue de Cambrai</Street>
                    </Streets>
                    <ZipCode ID="ZIP">75019</ZipCode>
                    <City ID="CITY">Paris</City>
                    <Country Code="FR" Override="Manual"/>
                </Address>
                <Telephones>
                    <Telephone ID="TEL">1320170125</Telephone>
                </Telephones>
                <Email ID="MAIL">lpoula.473247@guest.booking.com</Email>
            </Customer>
            <Trip>
                <Segment xsi:type="SegmentProductType">
                    <Code Role="Product" Value="${Site}" Override="Manual"/>
                    <Segments>
                        <Segment xsi:type="SegmentStayType">
                            <Begin Value="${Date}"/>
                            <Duration Unit="Night" Value="7"/>
                            <Ats>
                                <At ID="BLL24_1" Quantity="1">
                                    <Code Value="${Hebergement}"/>
                                    <Type Role="WebFare">
                                        <Code Ref="ID1"/>
                                    </Type>
                                    <!--facultatif-->
                                    <Travellers>
                                        <Traveller Ref="T1"/>
                                        <Traveller Ref="T2"/>
                                        <Traveller Ref="T3"/>
                                    </Travellers>
                                </At>
                            </Ats>
                        </Segment>
                        <Segment Quantity="1" xsi:type="SegmentInsuranceType">
                            <Code Value="${Assurance}"/>
                        </Segment>

                    </Segments>
                    <Begin Value="${Date}"/>
                    <Duration Unit="Night" Value="7"/>
                </Segment>
                <Travellers Filter="Exclude">
                    <Traveller ID="T1">
                        <Name>
                            <FirstName ID="FNAME">Ludovic</FirstName>
                            <LastName ID="NAME">Poulain</LastName>
                        </Name>
                    </Traveller>
                </Travellers>
            </Trip>
            <Booking>
                <Codes>
                    <Code Role="Reference" Name="ExternalReference" Value="Test BF "/>
                </Codes>
                <Descriptions>
                    <Description Role="Remark">
                        You have a booker that prefers communication by email
                        <Code Name="Code" Role="Reference" Value="TORMK">
                            <Description>TO Remarque</Description>
                        </Code>
                    </Description>
                </Descriptions>
            </Booking>
        </Transaction>
    </soapenv:Body>
</soapenv:Envelope>